abs
absorb
accepted
accepts
acquire
action
actions
active
actual
add
advance
affected
after
age
align
all
allowed
and
angle
anomaly
append
apply
area
arm
array
ascii
atomic
aux
available
axes
axis
background
backspace
barrier
basename
batched
begin
bind
binding
bits
blackout
blit
block
bool
boot
bootstrap
border
bounds
budget
buffer
build
bus
button
buttons
bytes
cache
cal
calibration
callback
cancel
canvas
capture
captured
cell
center
change
changed
char
chars
check
child
choice
claim
clamp
clear
clears
click
clickable
clicked
clip
clock
close
closure
cmd
cnc
coalesce
code
col
collect
color
colored
column
columns
command
commit
common
compact
compare
complete
compose
composed
config
confirm
consume
contain
content
continue
continuous
controller
coord
coordinate
copy
corrupt
count
countdown
cpu
crc
create
cross
cstr
current
cycle
daemon
data
date
deadline
defer
deferred
deg
degraded
delay
delete
delta
descriptor
destroy
digit
digits
dir
direct
dirty
disabled
disk
dismiss
disp
dispatch
display
distance
divider
dot
double
drag
drain
draw
drive
driver
dropdown
drv
dsc
due
during
dword
dynamic
edit
editable
enabled
encoder
end
ensure
entries
entry
epoch
equal
error
estop
eta
event
events
evidence
execute
execution
exercise
exists
expand
expect
expected
explicit
extension
external
extract
failed
failure
feed
field
fifo
file
fill
final
find
finish
finite
first
fit
flag
flags
flush
fnv
follow
font
for
force
format
frame
framebuffer
from
full
gate
generation
geometry
get
good
graphics
guard
guide
handle
has
header
headless
hidden
hide
highlight
hit
hits
hold
holder
home
homed
hook
icon
icons
idle
ignore
img
increment
indev
index
ini
init
initial
input
int
integer
internal
invalidate
invalidations
ipc
jog
json
keepalive
keeps
key
keyboard
kind
known
label
last
layer
layout
length
letter
library
limit
line
lines
linuxcncrsh
list
load
loaded
local
lock
log
long
loop
lvgl
machine
main
make
map
mark
mask
masks
match
matches
matrix
max
mcs
mdi
memlock
memory
metadata
metrics
mill
missing
modal
mode
model
models
monotonic
motion
mutation
name
nanoseconds
nat
native
nav
navigate
navigation
nearly
needs
network
new
newline
next
nonzero
normalize
notify
now
null
number
obj
object
objects
odd
off
offset
once
only
open
operator
ops
option
options
origin
other
output
overlay
override
owned
owner
page
pages
pair
panel
param
parameter
parse
path
paths
pattern
pause
pending
percent
perf
phase
physical
pixels
place
plain
plane
point
pointer
points
poll
popup
pos
pose
position
post
power
precondition
prepare
prepared
present
preserves
press
pressed
preview
previous
primitives
print
probe
process
program
progress
project
projection
projector
publish
pulse
pump
quantized
queue
raise
raw
read
readback
reader
real
recent
record
rect
rects
ref
refresh
refreshes
refs
register
registered
registry
release
reload
remembered
remote
remove
render
report
request
requested
requests
required
requires
reset
residency
resident
resolve
response
restart
restore
result
resume
return
rewrite
rgb
root
rotary
rotation
round
row
rows
rtcp
run
running
runtime
safe
safety
same
sample
save
scaffold
scan
scene
schedule
screen
scroll
seconds
section
seen
segment
segments
select
selected
selection
self
send
seq
sequence
set
setting
settings
setup
shell
shm
should
show
side
sign
signal
simple
single
six
size
slave
sleep
slider
sliders
slot
slots
smoke
snapshot
source
space
spec
speed
spindle
stale
start
state
static
status
step
stop
store
string
structure
style
success
summary
support
supported
suppressed
suppression
sync
tab
table
tables
target
terminal
test
text
thread
tick
time
timeout
timer
timing
tip
title
toggle
token
tokens
tool
toolpath
top
total
touch
trailing
trajectory
transaction
transform
transformed
trigger
trim
ull
unavailable
union
unique
unproven
until
update
upper
used
uses
valid
validate
value
values
vector
velocity
view
visible
visual
visuals
wait
wcs
widget
widgets
width
with
work
worker
world
wrappers
write
zero
zone